***3.Data Wrangling***

In [20]:
#3 Introduction
import pandas as pd
url="https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"

dataframe=pd.read_csv(url)
dataframe.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [21]:
#3.1 Creating a DataFrame
dataframe=pd.DataFrame()
dataframe['Name']=['John','Jane','Doe']
dataframe['Age']=[28,34,29]
dataframe['City']=['New York','Los Angeles','Chicago']
dataframe

   Name  Age         City
0  John   28     New York
1  Jane   34  Los Angeles
2   Doe   29      Chicago

In [22]:
new_person=pd.Series(['Molly Mooney',30,'San Francisco'],index=['Name','Age','City'])
dataframe = pd.concat([dataframe, new_person.to_frame().T], ignore_index=True)

In [23]:
#3.2 Describing the Data
dataframe.head(3)

   Name Age         City
0  John  28     New York
1  Jane  34  Los Angeles
2   Doe  29      Chicago

In [24]:
dataframe.shape

(4, 3)

In [25]:
url="https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"

dataframe=pd.read_csv(url)
dataframe.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [26]:
#3.3 Nvigating DataFrames
dataframe.iloc[1]

PassengerId                                                    2
Survived                                                       1
Pclass                                                         1
Name           Cumings, Mrs. John Bradley (Florence Briggs Th...
Sex                                                       female
Age                                                         38.0
SibSp                                                          1
Parch                                                          0
Ticket                                                  PC 17599
Fare                                                     71.2833
Cabin                                                        C85
Embarked                                                       C
Name: 1, dtype: object

In [27]:
dataframe.iloc [1:4]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [28]:
dataframe.iloc[:4]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [29]:
dataframe=dataframe.set_index(dataframe['Name']
                              )
dataframe.loc['Cumings, Mrs. John Bradley (Florence Briggs Thayer)']

PassengerId                                                    2
Survived                                                       1
Pclass                                                         1
Name           Cumings, Mrs. John Bradley (Florence Briggs Th...
Sex                                                       female
Age                                                         38.0
SibSp                                                          1
Parch                                                          0
Ticket                                                  PC 17599
Fare                                                     71.2833
Cabin                                                        C85
Embarked                                                       C
Name: Cumings, Mrs. John Bradley (Florence Briggs Thayer), dtype: object

In [30]:
#3.4 Selecting Rows Based on Conditions
dataframe[dataframe['Sex']=='female'].head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [31]:
dataframe[(dataframe['Sex']=='female') & (dataframe['Age']>=63)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Andrews, Miss. Kornelia Theodosia",276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
"Turkula, Mrs. (Hedwig)",484,1,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S

In [32]:
#3.5 Replacing values
dataframe['Sex'].replace("female","Woman").head(2)

Name
Braund, Mr. Owen Harris                                 male
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    Woman
Name: Sex, dtype: object

In [33]:
dataframe['Sex'].replace(["female","male"],["Woman","Man"]).head(5)

Name
Braund, Mr. Owen Harris                                  Man
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    Woman
Heikkinen, Miss. Laina                                 Woman
Futrelle, Mrs. Jacques Heath (Lily May Peel)           Woman
Allen, Mr. William Henry                                 Man
Name: Sex, dtype: object

In [34]:
dataframe.replace(1,"One").head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Braund, Mr. Owen Harris",One,0,3,"Braund, Mr. Owen Harris",male,22.0,One,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,One,One,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,One,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,One,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,One,One,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,One,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [35]:
dataframe.replace( "1st","First",regex=True).head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [36]:
#3.6 Renaming Columns
dataframe.rename(columns={'Pclass':'Passenger Class','SibSp':'Siblings/Spouses Aboard'}).head(2)

,PassengerId,Survived,Passenger Class,Name,Sex,Age,Siblings/Spouses Aboard,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [37]:
import collections
column_names=collections.defaultdict(str)
for name in dataframe.columns:
    column_names[name]
column_names

defaultdict(str,
            {'PassengerId': '',
             'Survived': '',
             'Pclass': '',
             'Name': '',
             'Sex': '',
             'Age': '',
             'SibSp': '',
             'Parch': '',
             'Ticket': '',
             'Fare': '',
             'Cabin': '',
             'Embarked': ''})

In [17]:
#3.7 Finding the minimum,maximum,sum,average and count 
import pandas as pd
dataframe=pd.read_csv('Social_Network_Ads.csv')

In [18]:
print('Maximum:',dataframe['Age'].max())
print('Minimum:',dataframe['Age'].min())
print('Mean:',dataframe['Age'].mean())
print('Sum:',dataframe['Age'].sum())
print('Count:',dataframe['Age'].count())

Maximum: 60
Minimum: 18
Mean: 37.655
Sum: 15062
Count: 400

In [19]:
dataframe.count()

User ID            400
Gender             400
Age                400
EstimatedSalary    400
Purchased          400
dtype: int64

In [20]:
#3.8 Finding Unique values
dataframe['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [21]:
dataframe['Gender'].value_counts()

Gender
Female    204
Male      196
Name: count, dtype: int64

In [22]:
#renmaing a column
dataframe.rename(columns={"Gender":"Sex"})

      User ID     Sex  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [10]:
dataframe['Purchased'].value_counts()

Purchased
0    257
1    143
Name: count, dtype: int64

In [23]:
#show number of unique values 
dataframe['Purchased'].nunique()

2

In [24]:
#3.9 Hnadling Missing values
dataframe=pd.read_csv('tested.csv')
dataframe[dataframe['Age'].isnull()].head(2)
#Pandas uses NumPy's nan value to denote missing values,but it's important to note that nan is not fully implemented navtively in pandas

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
22,914,1,1,"Flegenheim, Mrs. Alfred (Antoinette)",female,NaN,0,0,PC 17598,31.6833,NaN,S
29,921,0,3,"Samaan, Mr. Elias",male,NaN,2,0,2662,21.6792,NaN,C

In [ ]:
#3.10 Deleting a Column
#axis=0 operate column wise
#axis=1 operate row wise
dataframe.drop('Age',axis=1).head(2)

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,1,0,363272,7.0000,NaN,S

In [ ]:
#if a column does not have a name
#Treat your dataframe as immutable objects
dataframe.drop(dataframe.columns[1],axis=1).head(2)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [27]:
#3.11 Deleting a Row
dataframe=pd.read_csv('tested.csv')

In [ ]:
#use boolean condition
dataframe[dataframe['Sex']!='male'].head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [29]:
dataframe[dataframe['Name']!='Alexandra'].head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [30]:
#3.12 Dropping Duplicate Rows
df=pd.read_csv('tested.csv')
df.drop_duplicates().head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [31]:
#3.13 Grouping Rows by values
tested=pd.read_csv('tested.csv')

In [33]:
tested.groupby('Sex')[tested.select_dtypes(include='number').columns].mean()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,1096.789474,1.0,2.144737,30.272362,0.565789,0.598684,49.747699
male,1102.620301,0.0,2.334586,30.256845,0.379699,1313.131579,27.602241

In [34]:
tested.groupby(['Sex','Survived'])['Age'].mean()

Sex     Survived
female  1           30.272362
male    0           30.256845
Name: Age, dtype: float64

In [39]:
#3.14 Grouping Rows by Time
import numpy as np
import pandas as pd
time_index=pd.date_range('20230101',periods=6)
dataframe=pd.DataFrame({'A':np.random.randn(6),'B':np.random.randn(6)},index=time_index)
dataframe['Sales_Amount']=np.random.randint(1,10,6)
dataframe.resample('W').sum()

                   A         B  Sales_Amount
2023-01-01  0.478739  0.578026             6
2023-01-08  3.641611  2.078822            24

In [40]:
dataframe.head()

                   A         B  Sales_Amount
2023-01-01  0.478739  0.578026             6
2023-01-02  1.336534  1.290960             3
2023-01-03  0.387995 -0.007619             5
2023-01-04  0.575368  1.623332             6
2023-01-05  0.894648 -1.262500             4

In [41]:
dataframe.resample('2W').mean()

                   A         B  Sales_Amount
2023-01-01  0.478739  0.578026           6.0
2023-01-15  0.728322  0.415764           4.8

In [42]:
dataframe.resample('M').count()

C:\Users\ASUS\AppData\Local\Temp\ipykernel_8248\3305436376.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  dataframe.resample('M').count()

            A  B  Sales_Amount
2023-01-31  6  6             6

In [49]:
#3.15 Looping over a Column
df=pd.read_csv('tested.csv')

In [63]:
#Print first two names uppercased
for name in df ['Name'][0:2]:
    print(name.upper())

KELLY, MR. JAMES
WILKES, MRS. JAMES (ELLEN NEEDS)

In [64]:
# 3.16 Applying A function over all elements in a column
def uppercase(name):
    return name.upper()
df['Name'].apply(uppercase)[0:2] #show two rows

0                    KELLY, MR. JAMES
1    WILKES, MRS. JAMES (ELLEN NEEDS)
Name: Name, dtype: object

In [65]:
#3.17 Applying a Function to groups
df.groupby('Sex').apply(lambda name: name.count())

C:\Users\ASUS\AppData\Local\Temp\ipykernel_8248\3077360085.py:2: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df.groupby('Sex').apply(lambda name: name.count())

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,,,
female,152,152,152,152,152,127,152,152,152,152,44,152
male,266,266,266,266,266,206,266,266,266,264,48,265

In [66]:
# 3.18 Concatenating DataFrames
#Use concat with axis=0 to concatenate rows
data_a = {'Name': ['John', 'Jane', 'Doe'],
          'Age': [28, 34, 29]  }
data_b = {'Name': ['Alice', 'Bob', 'Charlie'],
          'Age': [25, 30, 35]  }
df_a = pd.DataFrame(data_a)
df_b = pd.DataFrame(data_b)
pd.concat([df_a, df_b], axis=0, ignore_index=True)

      Name  Age
0     John   28
1     Jane   34
2      Doe   29
3    Alice   25
4      Bob   30
5  Charlie   35

In [ ]:
pd.concat([df_a, df_b])

      Name  Age
0     John   28
1     Jane   34
2      Doe   29
0    Alice   25
1      Bob   30
2  Charlie   35

In [ ]:
#3.19 Merging DataFrames
data_a = {'Name': ['John', 'Jane', 'Doe'],
            'Age': [28, 34, 29]  }  
data_b = {'Name': ['Jane', 'Doe', 'Alice'],
            'City': ['Los Angeles', 'Chicago', 'San Francisco']  }
df_a = pd.DataFrame(data_a)
df_b = pd.DataFrame(data_b)
pd.merge(df_a, df_b, on='Name', how='outer') #how='inner','outer','left','right'

    Name   Age           City
0  Alice   NaN  San Francisco
1    Doe  29.0        Chicago
2   Jane  34.0    Los Angeles
3   John  28.0            NaN